app/controllers/application_controller.rb

      def get_user
        id = decode_token["id"]
        User.find_by(id: id)
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]