app/controllers/art_pieces_controller.rb

SELECT "art_pieces".* FROM "art_pieces"
---
    def index
        art_pieces = ArtPiece.all

INSERT INTO "art_pieces" ("title", "objectID", "isHighlight", "primaryImageSmall", "department", "culture", "artistDisplayName", "artistDisplayBio", "artistNationality", "artistWikidata_URL", "objectBeginDate", "objectEndDate", "medium", "dimensions", "city", "state", "country", "classification", "repository", "objectURL", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
INSERT INTO "collections" ("category", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category", "bestCat"], ["user_id", 1], ["created_at", "2020-03-20 16:03:36.473407"], ["updated_at", "2020-03-20 16:03:36.473407"]]
---
    def art_piece_params

        params.require(:art_piece).permit(:title, :objectID, :isHighlight, :primaryImage, :primaryImageSmall, :department, :culture, :artistDisplayName, :artistDisplayBio, :artistAlphaSort, :artistNationality, :artistWikidata_URL, :objectBeginDate, :objectEndDate, :medium, :dimensions, :city, :state, :country, :classification, :repository, :objectURL)
    end
end

ArtPiece.create(title: "bestPiece", objectID: 22, isHighlight: true, primaryImage: "",primaryImageSmall: "", department: "", culture: "", artistDisplayName: "", artistDisplayBio: "", artistNationality: "", artistWikidata_URL: "", objectBeginDate: 111, objectEndDate: 111, medium: "", dimensions: "", city: "", state: "", country: "", classification: "", repository: "", objectURL: "")
Collection.create(category: "bestCat", user_id: 1)