app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "rikesh28@hotmail.co.uk"], ["LIMIT", 1]]
---
    def sign_in
        user = User.find_by(username: params[:username])